Autodesk.Revit.DB.MEPAnalyticalConnectionType.Create(Autodesk.Revit.DB.Document,System.String)
Creates an analytical connection type element.
Remarks:
The newly created type would have the default pressure loss being 0.
Use ElementType.duplicate to copy from any existing type.
doc:
The document.
name:
The name of the analytical type to be created.
Returns:
The created analytical connection type element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This name is already used by an existing analytical connection type in the document.
-or-
name cannot include prohibited characters.
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018